spec/fixtures/responses/admin/request_access/http_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.channeladvisor.com/ChannelAdvisorAPI/v6/AdminService.asmx
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:web="http://api.channeladvisor.com/webservices/"><soap:Header><web:APICredentials><web:DeveloperKey>$$DEVELOPER_KEY$$</web:DeveloperKey><web:Password>$$PASSWORD$$</web:Password></web:APICredentials></soap:Header><soap:Body><web:RequestAccess><web:localID>$$LOCAL_ID$$</web:localID></web:RequestAccess></soap:Body></soap:Envelope>
    headers:
      soapaction:
      - ! '"http://api.channeladvisor.com/webservices/RequestAccess"'
      content-type:
      - text/xml;charset=UTF-8
      content-length:
      - '455'
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
  response:
    status:
      code: <%= code %>
      message: <%= message %>
    headers:
      date:
      - Mon, 21 May 2012 20:25:59 GMT
      server:
      - Microsoft-IIS/6.0
      x-servername:
      - RDU-IISWEB-11
      x-powered-by:
      - ASP.NET
      x-aspnet-version:
      - 4.0.30319
      transfer-encoding:
      - chunked
      cache-control:
      - private, max-age=0
      content-type:
      - text/xml; charset=utf-8
    body:
      encoding: US-ASCII
      string: <html><head><title><%= message %></title></head><body><%= message %></body></html>
    http_version: '1.1'
  recorded_at: Mon, 21 May 2012 20:25:59 GMT
recorded_with: VCR 2.1.1
