spec/fixtures/responses/admin/ping/soap_fault.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.channeladvisor.com/ChannelAdvisorAPI/v6/AdminService.asmx
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:web="http://api.channeladvisor.com/webservices/"><soap:Header><web:APICredentials><web:DeveloperKey>WRONG</web:DeveloperKey><web:Password>$$PASSWORD$$</web:Password></web:APICredentials></soap:Header><soap:Body><web:Ping/></soap:Body></soap:Envelope>
    headers:
      soapaction:
      - ! '"http://api.channeladvisor.com/webservices/Ping"'
      content-type:
      - text/xml;charset=UTF-8
      content-length:
      - '361'
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Mon, 21 May 2012 15:55:49 GMT
      server:
      - Microsoft-IIS/6.0
      x-servername:
      - RDU-IISWEB-04
      x-powered-by:
      - ASP.NET
      x-aspnet-version:
      - 4.0.30319
      cache-control:
      - private
      content-type:
      - text/xml; charset=utf-8
      content-length:
      - '517'
    body:
      encoding: US-ASCII
      string: ! "<soap:Envelope xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>\r\n
        \                          <soap:Body>\r\n                              <soap:Fault>\r\n
        \                                <faultcode>soap:Server</faultcode>\r\n                                 <faultstring>Server
        was unable to process request. Authentication failed.</faultstring>\r\n                                 <detail/>\r\n
        \                             </soap:Fault>\r\n                           </soap:Body>\r\n
        \                       </soap:Envelope>"
    http_version: '1.1'
  recorded_at: Mon, 21 May 2012 15:55:49 GMT
recorded_with: VCR 2.1.1
